projects.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 15 Sep. 2021 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Projects</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Tom Cornebize">
<link href='css/stylesheet.css?v=ac24febb9ec9a45064c8f47a95510660f7e637cfdb58fb98e80019c0d9d1ead1' rel='stylesheet'/>
<link href='css/navbar.css?v=98f777c359db5da90dae26bcf8f5b8a1c5edb1ea8ce880bf06e3fb5d94353a07' rel='stylesheet'/>
<link href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.3.0/css/font-awesome.min.css' rel='stylesheet'/>
<meta description='Website of Tom Cornebize'/>
<link rel='alternate' type='application+rss/xml' title='Website of Tom Cornebize' href='posts/rss.xml'/>
<link rel='stylesheet' href='css/index.css?v=b6242fb6bcd4260eff39de0bbc8070b66079a531479c6374431bb9bea1d9feb7'/>
</head>
<body>
<header id="preamble" class="status">
<div id="topnav">
    <ul>
        <li><a href="/">About</a></li>
        <li><a href=/projects.html>Projects</a></li>
        <li><a href=/publications.html>Publications</a></li>
        <li><a href=/posts/posts.html>Posts</a></li>
        <li class="right"><a href="https://www.linkedin.com/in/tomcornebize"                     class="list-group-item"><i class="fa fa-linkedin fa-fw"></i></a></li>
        <li class="right"><a href="https://scholar.google.com/citations?user=4YtfEysAAAAJ&hl=fr" class="list-group-item"><i class="fa fa-google fa-fw"></i></a></li>
        <li class="right"><a href="https://stackoverflow.com/users/4110059/tom-cornebize"        class="list-group-item"><i class="fa fa-stack-overflow fa-fw"></i></a></li>
        <li class="right"><a href="https://github.com/Ezibenroc/"                                class="list-group-item"><i class="fa fa-github fa-fw"></i></a></li>
        <li class="right"><a href="mailto:tom.cornebize@gmail.com"                               class="list-group-item"><i class="fa fa-envelope fa-fw"></i></a></li>
    </ul>
</div>
</header>
<main id="content">
<header>
<h1 class="title">Projects</h1>
</header><p>
Several open-source projects that I authored or contributed to.
</p>

<section id="outline-container-org02dc90b" class="outline-2">
<h2 id="org02dc90b">Roaring bitmaps</h2>
<div class="outline-text-2" id="text-org02dc90b">
<p>
Website: <a href="http://roaringbitmap.org">http://roaringbitmap.org</a>
</p>

<p>
Roaring bitmaps are fast and lightweight sets of unsigned 32 bits integers. They
can be several orders of magnitude more efficient than classical implementations
(e.g. hash tables, balanced binary trees, uncompressed bitmaps), both in terms
of time and memory consumption. Implementations exist in several languages,
including C and Python:
</p>
<ul class="org-ul">
<li><a href="https://github.com/RoaringBitmap/CRoaring">CRoaring</a> is a C implementation. I implemented several parts of the library:
range constructor, select query, subset test.</li>
<li><a href="https://github.com/Ezibenroc/PyRoaringBitMap">PyRoaring</a> is a Python wrapper for the C implementation. It allows to use
roaring bitmaps transparently in Python, with the speed of C. I implemented
most of the library, using the Cython programming language.</li>
</ul>
</div>
</section>
<section id="outline-container-org00467c6" class="outline-2">
<h2 id="org00467c6">G5K tests</h2>
<div class="outline-text-2" id="text-org00467c6">
<p>
Website: <a href="https://cornebize.net/g5k_test">https://cornebize.net/g5k_test</a>
</p>

<p>
Performance tests on <a href="https://www.grid5000.fr/">Grid&rsquo;5000</a>.
</p>

<p>
On a near-daily basis, I run micro-benchmarks on hundreds of Grid&rsquo;5000 nodes.
Several statistical tests are then performed on several metrics (e.g. CPU
performance, frequency, temperature, power consumption). I implemented the tests
in Python, it consists in estimating the likelihood to observe a new value (or a
sequence of new values) given the old observations.
</p>

<p>
These tests allowed to detect several events affecting significantly the nodes
performance. These events went unnoticed by both the staff and the users. With
further investigations, I could pinpoint the root cause most of the time
(cooling issue, faulty memory, power instability, BIOS upgrade).
</p>

<p>
I implemented this library during my PhD thesis, more information can be found
in the chapter 11 of my <a href="https://tel.archives-ouvertes.fr/tel-03328956/document">thesis</a>.
</p>
</div>
</section>
<section id="outline-container-orgbb38dc7" class="outline-2">
<h2 id="orgbb38dc7">Pycewise</h2>
<div class="outline-text-2" id="text-orgbb38dc7">
<p>
Repository: <a href="https://github.com/Ezibenroc/pycewise">https://github.com/Ezibenroc/pycewise</a>
</p>

<p>
Python module to compute a segmented linear regression.
</p>

<p>
It is implemented in Python, using a two-phase greedy algorithm. Several
objective functions are available: Ordinary Least Square, Weighted Least Square
(implemented with a closed formula), Logarithmic Least Square (implemented with
a gradient descent).
</p>

<p>
This module gave much better fits than other alternatives I tested on my data,
like <a href="https://github.com/DataDog/piecewise">Datadog&rsquo;s piecewise</a> or <a href="https://cran.r-project.org/web/packages/Cubist/index.html">Cubist</a>.
</p>

<p>
I implemented this library during my PhD thesis, more information can be found
in the chapter 5 of my <a href="https://tel.archives-ouvertes.fr/tel-03328956/document">thesis</a> (section 5.3.3).
</p>
</div>
</section>
<section id="outline-container-org711215b" class="outline-2">
<h2 id="org711215b">Peanut</h2>
<div class="outline-text-2" id="text-org711215b">
<p>
Repository: <a href="https://github.com/Ezibenroc/peanut">https://github.com/Ezibenroc/peanut</a>
</p>

<p>
Experiment engine for <a href="https://www.grid5000.fr/">Grid&rsquo;5000</a>.
</p>

<p>
This library allows to write experiments as readable and concise Python scripts.
Common tasks (e.g. node deployment, resource monitoring) are factorized in the
engine.  Experiment data and meta-data are automatically collected in an
archive.
</p>

<p>
I implemented this library during my PhD thesis, more information can be found
in the chapter 9 of my <a href="https://tel.archives-ouvertes.fr/tel-03328956/document">thesis</a>.
</p>
</div>
</section>
<section id="outline-container-org08746f7" class="outline-2">
<h2 id="org08746f7">Simgrid</h2>
<div class="outline-text-2" id="text-org08746f7">
<p>
Website: <a href="https://simgrid.org/">https://simgrid.org/</a>
</p>

<p>
Simgrid is a 20 year old free software to simulate a wide range of distributed
systems: grid, P2P, cloud, MPI applications. Its simulation models have been
theoretically and experimentally assessed.
</p>

<p>
I mostly used and contributed to SMPI a module of Simgrid which can
realistically simulate unmodified MPI applications. I implemented several
features to improve the simulation efficiency. I also greatly improved the
calibration procedure for modeling an existing platform.
</p>
</div>
</section>
<section id="outline-container-orga44b01e" class="outline-2">
<h2 id="orga44b01e">Platypus</h2>
<div class="outline-text-2" id="text-orga44b01e">
<p>
Website: <a href="https://projetpp.github.io">https://projetpp.github.io</a>
</p>

<p>
Platypus is a modular and open source question answering framework. Its main
purpose is to answer to questions asked in a natural language (e.g. in
English). For instance, it answers correctly to the question:
</p>

<blockquote>
<p>
What is the birth date of the president of the United States?
</p>
</blockquote>

<p>
For more information, read the <a href="doc/platypus_report.pdf">report</a> or the <a href="doc/platypus_slides.pdf">slides</a>. This work was initially a
student project. It was done as part of the master&rsquo;s first year at the ENS Lyon,
in a team of seven. The project has then been sold to <a href="https://lexistems.com/">Lexistems</a> and is no longer
actively maintained by ourselves.
</p>
</div>
</section>
</main>
<footer id="postamble" class="status">
<p>Last updated 15 Sep. 2021. Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="https://orgmode.org">Org</a> mode 9.4.6). <a href="/README.html">Details</a>.</p>
</footer>
</body>
</html>
